       IDENTIFICATION DIVISION.
       PROGRAM-ID. MY-FIRST-PROGRAM.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
          SPECIAL-NAMES.
             DECIMAL-POINT IS COMMA.
             SYMBOLIC CHARACTERS ESPACIO IS 33.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Cobol course fácil"
            STOP RUN.
       END PROGRAM MY-FIRST-PROGRAM.
