       IDENTIFICATION DIVISION.
       PROGRAM-ID. CHAPTER-8-PROGRAM.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
          01 NUMBER1 PIC 999 VALUE 15.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Display data: " NUMBER1
            STOP RUN.
       END PROGRAM CHAPTER-8-PROGRAM.
