       IDENTIFICATION DIVISION.
      * Comment character is place in the 7th column
       PROGRAM-ID. CHAPTER-9.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Codification sheets"
            STOP RUN.
       END PROGRAM CHAPTER-9.
