       IDENTIFICATION DIVISION.
       PROGRAM-ID. CHAPTER-10.
       PROCEDURE DIVISION.
            DISPLAY "This program only print this message.".
