       IDENTIFICATION DIVISION.
       PROGRAM-ID. CHAPTER-13.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
           01 NumberValue PIC 99 VALUE 1.
       PROCEDURE DIVISION.
       SHOW-VALUE.
            DISPLAY NumberValue
            STOP RUN.
       END PROGRAM CHAPTER-13.
