       IDENTIFICATION DIVISION.
       PROGRAM-ID. CHAPTER-15.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world"
            STOP RUN.
       END PROGRAM CHAPTER-15.
