       IDENTIFICATION DIVISION.
       PROGRAM-ID. CHAPTER-16.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
          DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
           01 Numb1 PIC 99 VALUE 10.
           01 Numb2 PIC 99 VALUE 3.
           01 ResultValue PIC 9V99 VALUE ZERO.
       PROCEDURE DIVISION.
       SHOW-RESULT.
            COMPUTE ResultValue = Numb1/Numb2.
            DISPLAY ResultValue.
            STOP RUN.
       END PROGRAM CHAPTER-16.
