       IDENTIFICATION DIVISION.
       PROGRAM-ID. CHAPTER-30.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       META-LANGUAGE.
            DISPLAY "Hello world"
            STOP RUN.
       END PROGRAM CHAPTER-30.
