       IDENTIFICATION DIVISION.
       PROGRAM-ID. CHAPTER-31.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77 Number1 PIC 99 VALUES ZEROS.
       77 Number2 PIC 99 VALUES ZEROS.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world"
            STOP RUN.
       END PROGRAM CHAPTER-31.
