       IDENTIFICATION DIVISION.
       PROGRAM-ID. CHAPTER-35.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            STOP RUN.
       END PROGRAM CHAPTER-35.
