       IDENTIFICATION DIVISION.
       PROGRAM-ID. CHAPTER-35.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       Paragraph1.
           DISPLAY "This is the paragraph 1".
           PERFORM Paragraph3.
       Paragraph2.
           DISPLAY "This is the paragraph 2".
           STOP RUN.
       Paragraph3.
           DISPLAY "This is the paragraph 3".
       END PROGRAM CHAPTER-35.
