       IDENTIFICATION DIVISION.
       PROGRAM-ID. CHAPTER-39.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       LOOP-PROCEDURE.
           PERFORM 5 TIMES
               DISPLAY "Repeat"
           END-PERFORM.
           STOP RUN.
       END PROGRAM CHAPTER-39.
