       IDENTIFICATION DIVISION.
       PROGRAM-ID. CHAPTER-39.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       LOOP-PROCEDURE.
           PERFORM Greeting 5 TIMES.
           STOP RUN.
           Greeting.
               DISPLAY "Repeat".

       END PROGRAM CHAPTER-39.
