       IDENTIFICATION DIVISION.
       PROGRAM-ID. CHAPTER-41.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77 nuMBERvALUE PIC 99 VALUE ZEROS.
       77 Multiplier PIC 999 VALUE ZEROS.
       77 Result PIC 999 VALUE ZEROS.
       77 OutputValue PIC XXXXX VALUES SPACES.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world"
            STOP RUN.
       END PROGRAM CHAPTER-41.
