       IDENTIFICATION DIVISION.
       PROGRAM-ID. CHAPTER-44.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77 NumberValue PIC 999.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
       PERFORM OPERATION
       VARYING NumberValue FROM 15 BY 1
       UNTIL NumberValue > 25.
            STOP RUN.
       OPERATION.
           DISPLAY NumberValue.
       END PROGRAM CHAPTER-44.
